## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 84 to add, 69 to change, 8 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].time_rotating.one_year
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].time_rotating.one_year
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CNP-Prod&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].time_rotating.one_year
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;CFT-Prod&#34;]
  * module.environment[&#34;prod&#34;].azuread_application.app
  * module.environment[&#34;ptlsbox&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_subscription.this
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_subscription.this
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_application.app
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_application.app
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_subscription.this
* Delete
  * module.subscription[&#34;DCD-CNP-PROD&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CNP-PROD&#34;].azuread_service_principal.sp
* Replace
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_3["CFT-Prod"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
        name                       = "CFT-Prod"
      ~ subscription_ids           = [
          + "1497c3d7-ab6d-4bb7-8a10-b51d03189ee3",
          + "1baf5470-1c3e-40d3-a6f7-74bfbce4b348",
          + "8999dec3-0104-4a27-94ee-6588559729d1",
          + "8cbc6f36-7c56-4963-9d36-739db5d00b27",
          + "96c274ce-846d-4e48-89a7-d528432298a7",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.environment["prod"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "9c149b18-7537-4b03-9093-641191faee0b"
      ~ owners                         = [
          - "6d2f8452-ba93-4a50-87a5-16e00f73af47",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.environment["ptlsbox"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "3fdcf12a-6a2c-46fc-be16-71510f849748"
      ~ owners                         = [
          - "23b042ae-86bd-4bb1-a9c0-04a24e1b435f",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_application.acme_appreg[0] will be updated in-place
  ~ resource "azuread_application" "acme_appreg" {
        id                             = "9e1a8420-a107-4e3b-bbf7-66ea652a0945"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "44d4bfca-e88d-403a-9b0f-f4e73b80c120"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access acme-dcd-cftapps-prod on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access acme-dcd-cftapps-prod" -> null
              - enabled                    = true -> null
              - id                         = "44d4bfca-e88d-403a-9b0f-f4e73b80c120" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access acme-dcd-cftapps-prod on your behalf." -> null
              - user_consent_display_name  = "Access acme-dcd-cftapps-prod" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access acme-dcd-cftapps-prod on behalf of the signed-in user."
              + admin_consent_display_name = "Access acme-dcd-cftapps-prod"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access acme-dcd-cftapps-prod on your behalf."
              + user_consent_display_name  = "Access acme-dcd-cftapps-prod"
              + value                      = "user_impersonation"
            }
        }

        # (7 unchanged blocks hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "5560d892-9d16-43d8-8d76-c0d6a70fb39a"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "2c7f08b5-41d6-456a-b3c6-765767ca37c1"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dcd-cftapps-prod) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Bootstrap (sub:dcd-cftapps-prod)" -> null
              - enabled                    = true -> null
              - id                         = "2c7f08b5-41d6-456a-b3c6-765767ca37c1" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dcd-cftapps-prod) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Bootstrap (sub:dcd-cftapps-prod)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dcd-cftapps-prod) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:dcd-cftapps-prod)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dcd-cftapps-prod) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:dcd-cftapps-prod)"
              + value                      = "user_impersonation"
            }
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "06da0dbc-49e2-44d2-8312-53f166ab848a" -> null
              - type = "Scope" -> null
            }
        }

      ~ web {
          ~ homepage_url  = "https://dts-bootstrap-application" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "5560d892-9d16-43d8-8d76-c0d6a70fb39a"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-PROD AKS Administrators" -> "Grants aks cluster admin permissions to the DCD-CFTAPPS-PROD subscription"
        id                         = "b9e4deb7-c192-4759-b55d-4acbb8d56937"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-PROD AKS Users" -> "Grants aks cluster user permissions to the DCD-CFTAPPS-PROD subscription"
        id                         = "9fe5adf3-09be-4988-8541-d23644eaeffb"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-PROD Subscription Contributors" -> "Grants contributor permissions to the DCD-CFTAPPS-PROD subscription"
        id                         = "97bc842d-fafe-4643-ac07-811fc0a65009"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group.groups["Key Vault Administrator"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-PROD Subscription Key Vault Administrators" -> "Grants key vault administrator permissions to the DCD-CFTAPPS-PROD subscription"
        id                         = "51875c2f-34d0-40e9-bd85-d889106ba0d4"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group.groups["Owner"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-PROD Subscription Owners" -> "Grants owner permissions to the DCD-CFTAPPS-PROD subscription"
        id                         = "a07dd401-9206-4afe-9d6b-9a65806b73d2"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group.groups["Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-PROD Subscription Readers" -> "Grants reader permissions to the DCD-CFTAPPS-PROD subscription"
        id                         = "44c2562a-c42f-44ad-baed-6d756e552421"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DCD-CFTAPPS-PROD subscription"
      + display_name                   = "DTS Security Readers (sub:dcd-cftapps-prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group.groups["Storage Blob Data Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-PROD Subscription Blob Readers" -> "Grants storage blob data contributor permissions to the DCD-CFTAPPS-PROD subscription"
        id                         = "b972f2e4-589b-4021-9b5a-7614706c8280"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "97bc842d-fafe-4643-ac07-811fc0a65009"
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group_member.members["Key Vault Administrator-0"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "51875c2f-34d0-40e9-bd85-d889106ba0d4/member/98053eb3-8523-4c5a-96d3-c15532f87c19" -> (known after apply)
      ~ member_object_id = "98053eb3-8523-4c5a-96d3-c15532f87c19" -> "1a4bada3-4107-47e4-a5d7-aa66a580369a" # forces replacement
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group_member.members["Key Vault Administrator-1"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "51875c2f-34d0-40e9-bd85-d889106ba0d4/member/1a4bada3-4107-47e4-a5d7-aa66a580369a" -> (known after apply)
      ~ member_object_id = "1a4bada3-4107-47e4-a5d7-aa66a580369a" -> "98053eb3-8523-4c5a-96d3-c15532f87c19" # forces replacement
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "8a9fd172-234d-44e3-b5a8-0c8d8ad24a75"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "e67f569b-c729-47b3-8340-7845eadddeb8"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/c8cbc6f36739db5d00b27kv"
        name                            = "c8cbc6f36739db5d00b27kv"
      ~ tags                            = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
      + content_type            = ""
        id                      = "https://c8cbc6f36739db5d00b27kv.vault.azure.net/secrets/sp-token/e9d22a9ecc6241ee9c98ad2b479f2071"
        name                    = "sp-token"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b9e4deb7-c192-4759-b55d-4acbb8d56937"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster Admin Role"
      + scope                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9fe5adf3-09be-4988-8541-d23644eaeffb"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_groups["Contributor"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "97bc842d-fafe-4643-ac07-811fc0a65009"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_groups["Key Vault Administrator"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "51875c2f-34d0-40e9-bd85-d889106ba0d4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_groups["Owner"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a07dd401-9206-4afe-9d6b-9a65806b73d2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_groups["Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "44c2562a-c42f-44ad-baed-6d756e552421"
      + principal_type                   = (known after apply)
      + role_definition_id               = (

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

     - enabled                    = true -> null
              - id                         = "6a35c137-43ac-4c88-aa44-41a10496e157" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dts-cftsbox-intsvc) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Bootstrap (sub:dts-cftsbox-intsvc)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dts-cftsbox-intsvc) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:dts-cftsbox-intsvc)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dts-cftsbox-intsvc) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:dts-cftsbox-intsvc)"
              + value                      = "user_impersonation"
            }
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "06da0dbc-49e2-44d2-8312-53f166ab848a" -> null
              - type = "Scope" -> null
            }
        }

      ~ web {
          ~ homepage_url  = "https://dts-bootstrap-application" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "29aed470-ba33-4139-a57a-0cec73053242"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-CFTSBOX-INTSVC AKS Administrators" -> "Grants aks cluster admin permissions to the DTS-CFTSBOX-INTSVC subscription"
        id                         = "ffcbcef3-e57b-4d46-a5d9-c38ddc612b22"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-CFTSBOX-INTSVC AKS Users" -> "Grants aks cluster user permissions to the DTS-CFTSBOX-INTSVC subscription"
        id                         = "1670590c-3334-4bf2-9ee9-c826b9744ed7"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-CFTSBOX-INTSVC Subscription Contributors" -> "Grants contributor permissions to the DTS-CFTSBOX-INTSVC subscription"
        id                         = "b01634eb-45c1-40c6-8550-0d1b019a9a7e"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the DTS-CFTSBOX-INTSVC subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:dts-cftsbox-intsvc)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group.groups["Owner"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-CFTSBOX-INTSVC Subscription Owners" -> "Grants owner permissions to the DTS-CFTSBOX-INTSVC subscription"
        id                         = "e91558b5-62ec-44ce-996c-e76627ea8b56"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group.groups["Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-CFTSBOX-INTSVC Subscription Readers" -> "Grants reader permissions to the DTS-CFTSBOX-INTSVC subscription"
        id                         = "62b7e5c7-08ed-45bd-b0c8-66477ad66101"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DTS-CFTSBOX-INTSVC subscription"
      + display_name                   = "DTS Security Readers (sub:dts-cftsbox-intsvc)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group.groups["Storage Blob Data Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-CFTSBOX-INTSVC Subscription Blob Readers" -> "Grants storage blob data contributor permissions to the DTS-CFTSBOX-INTSVC subscription"
        id                         = "4c3fddb9-f470-4c5e-9e82-a7f761d89f05"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "b01634eb-45c1-40c6-8550-0d1b019a9a7e"
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group_member.members["Key Vault Administrator-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group_member.members["Key Vault Administrator-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "2070d748-c35c-478f-a5ca-ec8a5c4ff10d"
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group_member.members["Owner-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "e91558b5-62ec-44ce-996c-e76627ea8b56"
      + id               = (known after apply)
      + member_object_id = "2070d748-c35c-478f-a5ca-ec8a5c4ff10d"
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "9630b424-43b6-4cc3-af97-d5217c7a27d5"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "a2bf4a80-fa77-4e49-a883-a3f72a2df2af"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv"
        name                            = "c1497c3d7b51d03189ee3kv"
      ~ tags                            = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
      + content_type            = ""
        id                      = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/secrets/sp-token/0bb0ca0b8f5c40d3a2a0dda369005ffd"
        name                    = "sp-token"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ffcbcef3-e57b-4d46-a5d9-c38ddc612b22"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster Admin Role"
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1670590c-3334-4bf2-9ee9-c826b9744ed7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_groups["Contributor"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b01634eb-45c1-40c6-8550-0d1b019a9a7e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_groups["Key Vault Administrator"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_groups["Owner"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e91558b5-62ec-44ce-996c-e76627ea8b56"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_groups["Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "62b7e5c7-08ed-45bd-b0c8-66477ad66101"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_storage_account.sa will be updated in-place
  ~ resource "azurerm_storage_account" "sa" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/c1497c3d7b51d03189ee3sa"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "c1497c3d7b51d03189ee3sa"
      ~ tags                              = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (34 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_subscription.this will be updated in-place
  ~ resource "azurerm_subscription" "this" {
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
        id                = "/providers/Microsoft.Subscription/aliases/DTS-CFTSBOX-INTSVC"
        tags              = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].random_uuid.acme_app_uuid[0] will be created
  + resource "random_uuid" "acme_app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 84 to add, 69 to change, 8 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->